miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_basic/src/driver/r_usb_hhubsys.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2014(2018) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hhubsys.c
 * Description  : USB Host Hub system code
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 08.01.2014 1.00 First Release
 *         : 26.12.2014 1.10 RX71M is added
 *         : 30.09.2015 1.11 RX63N/RX631 is added.
 *         : 30.09.2016 1.20 RX65N/RX651 is added.
 *         : 30.09.2017 1.22 Delete debug code(#if defined(USB_DEBUG_ON)).
 *                           Delete functions "usb_hhub_check_descriptor()","usb_hhub_device_descrip_info()",
 *                           "usb_hhub_config_descrip_info()","usb_hhub_endp_descrip_info()".
 *         : 31.03.2018 1.23 Supporting Smart Configurator
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
#include <string.h>

#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_extern.h"
#include "r_usb_bitdefine.h"
#include "r_usb_reg_access.h"

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Macro definitions
 ******************************************************************************/
/* Condition compilation by the difference of the devices */
#define USB_MAXHUB              ((uint16_t)1u)

#define USB_HUB_CLSDATASIZE     ((uint16_t)512u)
#define USB_HUB_QOVR            ((uint16_t)0xFFFEu)

#define USB_BIT_PORT_CONNECTION     (0x00000001u)
#define USB_BIT_PORT_ENABLE         (0x00000002u)
#define USB_BIT_PORT_SUSPEND        (0x00000004u)
#define USB_BIT_PORT_OVER_CURRENT   (0x00000008u)
#define USB_BIT_PORT_RESET          (0x00000010u)
#define USB_BIT_PORT_POWER          (0x00000100u)
#define USB_BIT_PORT_LOW_SPEED      (0x00000200u)
#define USB_BIT_C_PORT_CONNECTION   (0x00010000u)
#define USB_BIT_C_PORT_ENABLE       (0x00020000u)
#define USB_BIT_C_PORT_SUSPEND      (0x00040000u)
#define USB_BIT_C_PORT_OVER_CURRENT (0x00080000u)
#define USB_BIT_C_PORT_RESET        (0x00100000u)

/* HUB down port */
#define USB_HUBDOWNPORT                 (4u)    /* HUB down port (MAX15) */

/******************************************************************************
 Typedef definitions
 ******************************************************************************/
typedef struct
{
    uint16_t up_addr; /* Up-address  */
    uint16_t up_port_num; /* Up-port num */
    uint16_t port_num; /* Port number */
    uint16_t pipe_num; /* Pipe number */
} usb_hub_info_t;

/******************************************************************************
 Private global variables and functions
 ******************************************************************************/
static uint16_t usb_hhub_chk_config (uint16_t **table, uint16_t spec);
static uint16_t usb_hhub_chk_interface (uint16_t **table, uint16_t spec);
static uint16_t usb_hhub_pipe_info (usb_utr_t *ptr, uint8_t *table, uint16_t speed, uint16_t length);
static void usb_hhub_port_detach (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum);
static void usb_hhub_selective_detach (usb_utr_t *ptr, uint16_t devaddr);
static void usb_hhub_trans_start (usb_utr_t *ptr, uint16_t hubaddr, uint32_t size, uint8_t *table, usb_cb_t complete);
static void usb_hhub_trans_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2);
static uint16_t usb_hhub_get_new_devaddr (usb_utr_t *ptr);
static uint16_t usb_hhub_get_hubaddr (usb_utr_t *ptr, uint16_t pipenum);
static uint16_t usb_hhub_get_cnn_devaddr (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum);
static uint16_t usb_hhub_port_set_feature (usb_utr_t *ptr, uint16_t hubaddr, uint16_t port, uint16_t command,
        usb_cb_t complete);
static uint16_t usb_hhub_port_clr_feature (usb_utr_t *ptr, uint16_t hubaddr, uint16_t port, uint16_t command,
        usb_cb_t complete);
static void usb_hhub_init_down_port (usb_utr_t *ptr, uint16_t hubaddr, usb_clsinfo_t *mess);
static void usb_hhub_new_connect (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum, usb_clsinfo_t *mess);
static uint16_t usb_hhub_port_attach (uint16_t hubaddr, uint16_t portnum, usb_clsinfo_t *mess);
static void usb_hhub_port_reset (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum, usb_clsinfo_t *mess);

#if (BSP_CFG_RTOS_USED == 0)
static void usb_hhub_enumeration (usb_clsinfo_t *mess);
static void usb_hhub_event (usb_clsinfo_t *mess);
static void usb_hhub_specified_path (usb_clsinfo_t *mess);
static void usb_hhub_specified_path_wait (usb_clsinfo_t *mess, uint16_t times);
static void usb_hhub_class_request_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2);
static void usb_hhub_check_request (usb_utr_t *ptr, uint16_t result);
static uint16_t usb_hhub_request_result (uint16_t checkerr);
#endif /* (BSP_CFG_RTOS_USED == 0) */

static void usb_hhub_initial (usb_utr_t *ptr, uint16_t data1, uint16_t data2);
static void usb_hhub_check_class (usb_utr_t *ptr, uint16_t **table);

