miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/
/* Control transfer message */
usb_utr_t g_usb_shhub_ctrl_mess[USB_NUM_USBIP];

/* Data transfer message */
usb_utr_t g_usb_shhub_data_mess[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];

/* HUB descriptor */
uint8_t g_usb_hhub_descriptor[USB_NUM_USBIP][USB_CONFIGSIZE];

/* HUB status data */
uint8_t g_usb_hhub_data[USB_NUM_USBIP][USB_MAXDEVADDR + 1u][8];

/* HUB down port status */
uint16_t g_usb_shhub_down_port[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];

/* Down port remote wake up */
uint16_t g_usb_shhub_remote[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];

/* Up-hubaddr, up-hubport, portnum, pipenum */
usb_hub_info_t g_usb_shhub_info_data[USB_NUM_USBIP][USB_MAXDEVADDR + 1u];
uint16_t g_usb_shhub_number[USB_NUM_USBIP];
uint16_t g_usb_shhub_class_request[USB_NUM_USBIP][5];

/* Condition compilation by the difference of USB function */
#if USB_NUM_USBIP == 2
uint16_t g_usb_shhub_class_seq[USB_NUM_USBIP]   = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_init_seq[USB_NUM_USBIP]    = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_init_port[USB_NUM_USBIP]   = {USB_HUB_P1,  USB_HUB_P1};
uint16_t g_usb_shhub_event_seq[USB_NUM_USBIP]   = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_event_port[USB_NUM_USBIP]  = {USB_HUB_P1,  USB_HUB_P1};
uint16_t g_usb_shhub_attach_seq[USB_NUM_USBIP]  = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_reset_seq[USB_NUM_USBIP]   = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_state[USB_NUM_USBIP]       = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_info[USB_NUM_USBIP]        = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_hub_addr[USB_NUM_USBIP]    = {USB_SEQ_0,   USB_SEQ_0};
uint16_t g_usb_shhub_process[USB_NUM_USBIP]     = {USB_SEQ_0,   USB_SEQ_0};
#else   /* USB_NUM_USBIP == 2 */
uint16_t g_usb_shhub_class_seq[USB_NUM_USBIP]   = {USB_SEQ_0};
uint16_t g_usb_shhub_init_seq[USB_NUM_USBIP]    = {USB_SEQ_0};
uint16_t g_usb_shhub_init_port[USB_NUM_USBIP]   = {USB_HUB_P1};
uint16_t g_usb_shhub_event_seq[USB_NUM_USBIP]   = {USB_SEQ_0};
uint16_t g_usb_shhub_event_port[USB_NUM_USBIP]  = {USB_HUB_P1};
uint16_t g_usb_shhub_attach_seq[USB_NUM_USBIP]  = {USB_SEQ_0};
uint16_t g_usb_shhub_reset_seq[USB_NUM_USBIP]   = {USB_SEQ_0};
uint16_t g_usb_shhub_state[USB_NUM_USBIP]       = {USB_SEQ_0};
uint16_t g_usb_shhub_info[USB_NUM_USBIP]        = {USB_SEQ_0};
uint16_t g_usb_shhub_hub_addr[USB_NUM_USBIP]    = {USB_SEQ_0};
uint16_t g_usb_shhub_process[USB_NUM_USBIP]     = {USB_SEQ_0};

#endif  /* USB_NUM_USBIP == 2 */

uint8_t *g_p_usb_shhub_device_table[USB_NUM_USBIP];
uint8_t *g_p_usb_shhub_config_table[USB_NUM_USBIP];
uint8_t *g_p_usb_shhub_interface_table[USB_NUM_USBIP];
uint16_t g_usb_shhub_spec[USB_NUM_USBIP];
uint16_t g_usb_shhub_root[USB_NUM_USBIP];
uint16_t g_usb_shhub_speed[USB_NUM_USBIP];
uint16_t g_usb_shhub_dev_addr[USB_NUM_USBIP];

const uint16_t g_usb_hhub_tpl[4] =
{
    USB_CFG_HUB_TPLCNT, /* Number of tpl table */
    0, /* Reserved */
    USB_CFG_HUB_TPL /* Vendor ID, Product ID */
};

/* Enumeration request */
extern uint8_t g_usb_hstd_class_data[][512];
extern void (*g_usb_hstd_enumaration_process[]) (usb_utr_t *, uint16_t, uint16_t);

/******************************************************************************
 Renesas Abstracted Hub Driver API functions
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_open
 Description     : HUB sys open
 Arguments       : uint16_t devaddr : Device address
                 : uint16_t data2   : Not used
 Return value    : usb_er_t         : Error Info
 ******************************************************************************/
void usb_hhub_open (usb_utr_t *ptr, uint16_t devaddr, uint16_t data2)
{
    usb_er_t err, err2;
    usb_mh_t p_blf;
    usb_mgrinfo_t *mp;
    uint16_t hubaddr;

    err = USB_ERROR;
    hubaddr = (uint16_t) (devaddr << USB_DEVADDRBIT);

    if (USB_MAXHUB != g_usb_shhub_number[ptr->ip])
    {
        /* Wait 10ms */
        usb_cpu_delay_xms((uint16_t) 10);
        err = USB_PGET_BLK(USB_HUB_MPL, &p_blf);
        if (USB_OK == err)
        {
            mp = (usb_mgrinfo_t*) p_blf;
            mp->msghead = (usb_mh_t) USB_NULL;
#if (BSP_CFG_RTOS_USED == 1)
            mp->msginfo = USB_MSG_HUB_START;
#else /* (BSP_CFG_RTOS_USED == 1) */
            mp->msginfo = USB_MSG_CLS_INIT;
#endif /* (BSP_CFG_RTOS_USED == 1) */
            mp->keyword = devaddr;

            mp->ipp = ptr->ipp;
            mp->ip = ptr->ip;

            /* Send message */
            err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
            if (USB_OK != err)
            {
                /* Send Message failure */
                USB_PRINTF1("### hHubOpen snd_msg error (%ld)\n", err);
                err2 = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
                if (USB_OK != err2)
                {
                    USB_PRINTF1("### hHubOpen rel_blk error (%ld)\n", err2);
                }
            }
        }
        else
        {
            /* Release memory block failure */
            USB_PRINTF1("### hHubOpen pget_blk error (%ld)\n", err);
            while (1)
            {
                /* Non */
            }
        }

        /* Pipe number set */
        g_usb_shhub_info_data[ptr->ip][devaddr].pipe_num = USB_HUB_PIPE;

        /* HUB down port status */
        g_usb_shhub_down_port[ptr->ip][devaddr] = 0;

        /* Down port remote wake up */
        g_usb_shhub_remote[ptr->ip][devaddr] = 0;
        g_usb_pipe_table[ptr->ip][USB_HUB_PIPE].pipe_maxp |= hubaddr;

#if (BSP_CFG_RTOS_USED == 0)
        g_usb_shhub_process[ptr->ip] = USB_MSG_CLS_INIT;
#endif /* (BSP_CFG_RTOS_USED == 0) */
        usb_hstd_set_pipe_reg (ptr, USB_HUB_PIPE);

        g_usb_shhub_number[ptr->ip]++;
    }
}
/******************************************************************************
 End of function usb_hhub_open
 ******************************************************************************/

