miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor2
 Description     : Get String descriptor
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t devaddr     : Device address
                 : uint16_t index       : Descriptor index
                 : usb_cb_t complete    : Callback function
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor2 (usb_utr_t *ptr, uint16_t devaddr, uint16_t index, usb_cb_t complete)
{
#if (BSP_CFG_RTOS_USED == 1)
    usb_hstd_get_string_desc(ptr, devaddr, index);
#else /* (BSP_CFG_RTOS_USED == 1) */
    usb_hstd_get_string_desc(ptr, devaddr, index, complete);
#endif /* (BSP_CFG_RTOS_USED == 1) */
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor2
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor1check
 Description     : Get String descriptor Check
 Arguments       : uint16_t errcheck    : errcheck
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor1check (uint16_t errcheck)
{
    if ((usb_er_t) USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** LanguageID  not support !\n");
        return USB_ERROR;
    }
    else if ((usb_er_t) USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** LanguageID  not support !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor1check
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor_to_check
 Description     : Get String descriptor Check
 Arguments       : uint16_t errcheck         : errcheck
 Return value    : uint16_t                  : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor_to_check (uint16_t errcheck)
{
    if ((usb_er_t) USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** SerialNumber not support !\n");
        return USB_ERROR;
    }
    else if ((usb_er_t) USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** SerialNumber not support !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor_to_check
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hhub_get_new_devaddr
 Description     : Get the new device address
                 : when connection of a device detected in the down port of HUB
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
 Return value    : uint16_t             : Device address
 ******************************************************************************/
static uint16_t usb_hhub_get_new_devaddr (usb_utr_t *ptr)
{
    uint16_t i;

    /* Search new device */
    for (i = (USB_HUBDPADDR); i < (USB_MAXDEVADDR + 1u); i++)
    {
        if (0 == g_usb_shhub_info_data[ptr->ip][i].up_addr)
        {
            /* New device address */
            return i;
        }
    }
    return 0;
}
/******************************************************************************
 End of function usb_hhub_get_new_devaddr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_hubaddr
 Description     : Get the HUB address
                 : from the pipe number for HUB notification
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t pipenum     : Pipe number
 Return value    : uint16_t             : HUB address
 ******************************************************************************/
static uint16_t usb_hhub_get_hubaddr (usb_utr_t *ptr, uint16_t pipenum)
{
    uint16_t i;

    for (i = 1; i < (USB_MAXDEVADDR + 1u); i++)
    {
        if (g_usb_shhub_info_data[ptr->ip][i].pipe_num == pipenum)
        {
            /* HUB address */
            return i;
        }
    }
    return 0;
}
/******************************************************************************
 End of function usb_hhub_get_hubaddr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_cnn_devaddr
 Description     : Get the connected device address
                 : from the HUB address and the down port number of a HUB
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : Hub address
                 : uint16_t portnum     : Down port number
 Return value    : uint16_t             : Connected device address
 ******************************************************************************/
static uint16_t usb_hhub_get_cnn_devaddr (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum)
{
    uint16_t i;

    for (i = (USB_HUBDPADDR); i < (USB_MAXDEVADDR + 1u); i++)
    {
        if ((g_usb_shhub_info_data[ptr->ip][i].up_addr == hubaddr)
                && (g_usb_shhub_info_data[ptr->ip][i].up_port_num == portnum))
        {
            /* Device address */
            return i;
        }
    }
    return 0;
}
/******************************************************************************
 End of function usb_hhub_get_cnn_devaddr
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hhub_specified_path
 Description     : Next Process Selector
 Arguments       : usb_clsinfo_t *ptr    : Pointer to usb_clsinfo_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_specified_path (usb_clsinfo_t *ptr)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;

    /* Get memory pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = g_usb_shhub_process[ptr->ip];
        cp->keyword = ptr->keyword;
        cp->result = ptr->result;

        cp->ipp = ptr->ipp;
        cp->ip = ptr->ip;

        /* Send message */
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            /* Send message failure */
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### SpecifiedPass function snd_msg error\n");
        }
    }
    else
    {
        /* Get memory block failure */
        USB_PRINTF0("### SpecifiedPass function pget_blk error\n");
        while (1)
        {
            /* Non */
        }
    }
}
/******************************************************************************
 End of function usb_hhub_specified_path
 ******************************************************************************/

